using System;

/* Двумерный массив
 * 
 * Источник: https://www.youtube.com/watch?v=bMjDIIh46BY
 */

namespace _029___Многомерные_массивы
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* Двумерный массив - многомерный массив.
             * 
             * Многомерные массивы бывают прямоугольные и ступеньчатые(зубчатые)
             *  
             * Двумерный прямоугольный массив похож на таблицу Excel
             * или лист в клеточку.
             */
        }
    }
}
